In [1]:
import pandas as pd

In [4]:
import numpy as  np

In [5]:
s = pd.Series(np.random.rand(5),index=['a','b','c','d','e'])

In [6]:
s

a    0.585445
b    0.476938
c    0.201318
d    0.444978
e    0.656499
dtype: float64

In [7]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [8]:
 s[0]

0.58544504926769347

In [9]:
s[[1,3,4]]

b    0.476938
d    0.444978
e    0.656499
dtype: float64

In [11]:
np.sin(s)

a    0.552570
b    0.459061
c    0.199961
d    0.430438
e    0.610347
dtype: float64

In [12]:
s['a']

0.58544504926769347

In [13]:
s['g']=100

In [14]:
s

a      0.585445
b      0.476938
c      0.201318
d      0.444978
e      0.656499
g    100.000000
dtype: float64

In [15]:
s1 = pd.Series(np.random.rand(3),index=['a','c','e'])

In [16]:
s2 = pd.Series(np.random.rand(3),index=['a','d','e'])

In [18]:
s1+ s2

a    1.452295
c         NaN
d         NaN
e    0.537914
dtype: float64

In [19]:
d = {'one':pd.Series([1,2,3], index = ['a','b','c',]),
    'two':pd.Series([1,2,3,4] ,index=['a','b','c','d'])}

In [20]:
df = pd.DataFrame(d)

In [21]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [22]:
df = pd.DataFrame(d, index= ('d','b','a'))

In [23]:
df

   one  two
d  NaN    4
b  2.0    2
a  1.0    1

In [24]:
df = pd.DataFrame(d,columns=['two','three'])

In [25]:
df

   two three
a    1   NaN
b    2   NaN
c    3   NaN
d    4   NaN

In [28]:
data = [(1,2.2,'Hello'),(2,3,'world')]

In [29]:
df= pd.DataFrame(data, index = ['one','two'],columns=list('ABC'))

In [30]:
df

     A    B      C
one  1  2.2  Hello
two  2  3.0  world

In [31]:
d = {('a','b'):{('A','B'):1,('A','C'):2},
    ('a','a'):{('A','C'):3,('A','B'):4},
    ('a','c'):{('A','B'):5,('A','C'):6},
    ('b','a'):{('A','C'):7,('A','B'):8},
    ('b','b'):{('A','D'):9,('A','B'):10},}

In [32]:
df = pd.DataFrame(d)

In [33]:
df

       a              b
       a    b    c    a     b
A B  4.0  1.0  5.0  8.0  10.0
  C  3.0  2.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [34]:
df = pd.DataFrame(np.random.rand(6,4),columns=['one','two','three','four'])

In [35]:
df

        one       two     three      four
0  0.971839  0.986308  0.894258  0.790609
1  0.980987  0.430299  0.965870  0.317651
2  0.457289  0.929484  0.456404  0.249430
3  0.403419  0.170987  0.925132  0.444646
4  0.094798  0.277196  0.335273  0.165171
5  0.709931  0.608403  0.910809  0.364796

In [36]:
df['one']

0    0.971839
1    0.980987
2    0.457289
3    0.403419
4    0.094798
5    0.709931
Name: one, dtype: float64

In [37]:
df.loc[1]

one      0.980987
two      0.430299
three    0.965870
four     0.317651
Name: 1, dtype: float64

In [38]:
df['three'] = df ['one'] + df['two']

In [39]:
df

        one       two     three      four
0  0.971839  0.986308  1.958147  0.790609
1  0.980987  0.430299  1.411286  0.317651
2  0.457289  0.929484  1.386773  0.249430
3  0.403419  0.170987  0.574406  0.444646
4  0.094798  0.277196  0.371994  0.165171
5  0.709931  0.608403  1.318335  0.364796

In [40]:
del df['three']

In [41]:
df

        one       two      four
0  0.971839  0.986308  0.790609
1  0.980987  0.430299  0.317651
2  0.457289  0.929484  0.249430
3  0.403419  0.170987  0.444646
4  0.094798  0.277196  0.165171
5  0.709931  0.608403  0.364796

In [42]:
df['five'] = df ['one']

In [43]:
df

        one       two      four      five
0  0.971839  0.986308  0.790609  0.971839
1  0.980987  0.430299  0.317651  0.980987
2  0.457289  0.929484  0.249430  0.457289
3  0.403419  0.170987  0.444646  0.403419
4  0.094798  0.277196  0.165171  0.094798
5  0.709931  0.608403  0.364796  0.709931

In [44]:
df ['six'] =5

In [45]:
df

        one       two      four      five  six
0  0.971839  0.986308  0.790609  0.971839    5
1  0.980987  0.430299  0.317651  0.980987    5
2  0.457289  0.929484  0.249430  0.457289    5
3  0.403419  0.170987  0.444646  0.403419    5
4  0.094798  0.277196  0.165171  0.094798    5
5  0.709931  0.608403  0.364796  0.709931    5

In [46]:
s = df.pop('four')

In [47]:
s

0    0.790609
1    0.317651
2    0.249430
3    0.444646
4    0.165171
5    0.364796
Name: four, dtype: float64

In [48]:
df

        one       two      five  six
0  0.971839  0.986308  0.971839    5
1  0.980987  0.430299  0.980987    5
2  0.457289  0.929484  0.457289    5
3  0.403419  0.170987  0.403419    5
4  0.094798  0.277196  0.094798    5
5  0.709931  0.608403  0.709931    5

In [51]:
df.insert(1,'bar',df['one']+df['six'])

In [53]:
df

        one       bar       two      five  six
0  0.971839  5.971839  0.986308  0.971839    5
1  0.980987  5.980987  0.430299  0.980987    5
2  0.457289  5.457289  0.929484  0.457289    5
3  0.403419  5.403419  0.170987  0.403419    5
4  0.094798  5.094798  0.277196  0.094798    5
5  0.709931  5.709931  0.608403  0.709931    5

In [52]:
df

        one       bar       two      five  six
0  0.971839  5.971839  0.986308  0.971839    5
1  0.980987  5.980987  0.430299  0.980987    5
2  0.457289  5.457289  0.929484  0.457289    5
3  0.403419  5.403419  0.170987  0.403419    5
4  0.094798  5.094798  0.277196  0.094798    5
5  0.709931  5.709931  0.608403  0.709931    5

In [54]:
df.assign(Ratio= df['one']/df['two'])

        one       bar       two      five  six     Ratio
0  0.971839  5.971839  0.986308  0.971839    5  0.985330
1  0.980987  5.980987  0.430299  0.980987    5  2.279782
2  0.457289  5.457289  0.929484  0.457289    5  0.491982
3  0.403419  5.403419  0.170987  0.403419    5  2.359350
4  0.094798  5.094798  0.277196  0.094798    5  0.341991
5  0.709931  5.709931  0.608403  0.709931    5  1.166876

In [55]:
df

        one       bar       two      five  six
0  0.971839  5.971839  0.986308  0.971839    5
1  0.980987  5.980987  0.430299  0.980987    5
2  0.457289  5.457289  0.929484  0.457289    5
3  0.403419  5.403419  0.170987  0.403419    5
4  0.094798  5.094798  0.277196  0.094798    5
5  0.709931  5.709931  0.608403  0.709931    5